---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateCorniceIntegralWarn
source: html/9137ce65-4002-6eda-5689-c3c09a987bd9.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateCorniceIntegralWarn Property

Could not create integral wall sweep for wall instance. [Description]

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCreateCorniceIntegralWarn { get; }
```